_site/app/controllers/gifts_controller.rb

SELECT  "gifts".* FROM "gifts"  WHERE "gifts"."name" = '5 night stay at Koa Kea'  ORDER BY "gifts"."id" ASC LIMIT 1
---
  def index
    wanderable = Wanderable.new(ENV['WANDERABLE_URL'])
    wanderable.scrape_gifts
    @gifts = Gift.order(:name)